Repository: 84000/data-translation-memory
Catalog: Toh_134-The_Absorption_That_Encapsulates_All_Merit-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འགྲོགས་ན་བདེ་བས་དེས་བར་བྱའོ། །
en: Bodhisattvas should be easy to be with and gentle.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འཐུན་པར་འཛིན་པས་བཀའ་བློ་བདེ་བར་བྱའོ། །
en: Bodhisattvas should be agreeable and eloquent.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་པས་ང་རྒྱལ་གཞོམ་པར་བྱའོ། །
en: Bodhisattvas should bow before all beings and overcome their pride.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ང་རྒྱལ་བཅག་པས་ཁྱི་དང་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should have humbled their pride, like dogs.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སྔོན་དམ་བཅས་པ་ཉམས་སུ་ལོན་པར་བྱེད་པས་སླུ་བ་མེད་པར་བྱའོ། །
en: Bodhisattvas should be undeceiving, fulfilling the promises they made in the past.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པར་བྱའོ། །
en: Bodhisattvas should be impartial toward all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འབྱུང་པོ་ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་སུ་བྱའོ། །
en: Bodhisattvas should have a loving mindset toward all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ལ་མངོན་པར་བརྩོན་པས་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should have great compassion, striving for the aims of all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་དང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པས་སེམས་དགའ་བར་བྱའོ། །
en: Bodhisattvas should take pleasure in endeavoring to pursue the Buddha’s teachings and all roots of virtue.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འདོད་པའི་ཡོན་ཏན་གྱི་དགའ་བ་དང་རྩེ་བ་ཐམས་ཅད་ལ་མི་ལྟ་བས་བཏང་སྙོམས་སུ་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should maintain equanimity, without any regard for the joys and delights of sensual pleasures.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རང་གི་ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བས་སེར་སྣ་མེད་པར་བྱའོ། །
en: “Bodhisattvas should be without stinginess, giving up their bodies and lives entirely.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཡོངས་སུ་གཟུང་བའི་དངོས་པོ་རྣམས་ལ་བདག་གིར་འཛིན་པ་མེད་པར་བྱའོ། །
en: Bodhisattvas should be free of clinging to material possessions as their own.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཡོངས་སུ་རྟོག་པ་དང་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་དོར་བའི་སེམས་སུ་བྱའོ། །
en: Bodhisattvas should be intent on giving up all concepts and views.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ནོར་བདུན་གྱི་ནོར་ཆེན་པོས་ཕྱུག་པར་བྱའོ། །
en: Bodhisattvas should be rich in the great wealth of the seven riches.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སྒྲུབ་པ་ལ་གནས་པས་བརྟན་པ་དང་ལྡན་པར་བྱའོ། །
en: Bodhisattvas should be steadfast and grounded in practice.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་མཐའ་ཡས་པ་ཚོལ་བས་ཆོག་མི་ཤེས་པར་བྱའོ། །
en: Bodhisattvas should be insatiable in pursuit of the infinite qualities of buddhahood.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱིས་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: Bodhisattvas should be replete with the perfections.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བདུད་བཞི་ལས་རྣམ་པར་རྒྱལ་བས་དཔའ་བར་བྱའོ། །
en: “Bodhisattvas should have the heroism that comes from conquering the four demons.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་ཞི་བར་བྱ་བ་ལ་མཁས་པས་སྨན་པའི་རྒྱལ་པོར་བྱའོ། །
en: Bodhisattvas should be the foremost physicians, skilled in healing all beings of their maladies, the afflictions.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་ཀྱི་སེམས་དང་མ་བྲལ་བས་ཡོན་གནས་སུ་བྱའོ། །
en: Bodhisattvas should be objects of veneration, never apart from the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བས་བསོད་ནམས་ཀྱི་ཞིང་དུ་བྱའོ། །
en: Bodhisattvas should be fields of merit in their concern for all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱི་འདམ་གྱིས་མི་གོས་པས་པད་མ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like lotuses, unstained by the mud of mundane things.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་སྒྲོལ་བས་གྲུ་དང་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should be like boats, bringing all beings to freedom.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རབ་དང་འབྲིང་དང་ཐ་མ་ལ་མི་བརྙས་པས་ཟམ་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like bridges, with no contempt for anyone, high, medium, or low.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་དམ་པའི་ཆོས་ཀྱི་ཆུ་མི་ཟད་པའི་བསམ་པས་ཆུ་མིག་དང་། མཚོ་དང་། མཚོ་བྲན་དང་། མཚེའུ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like springs, lakes, pools, and ponds, resolved to make the water of the sublime teachings inexhaustible.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཐོས་པ་ལ་རྩེ་གཅིག་པས་ཆོག་མི་ཤེས་པས་རྒྱ་མཚོ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be as insatiable as the ocean in their one-pointed desire to learn.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བསྐྱོད་དུ་མེད་པས་ལྷུན་པོ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be as immovable as the central mountain.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སྒོའི་ཐེམ་པའི་རྟེན་ལྟ་བུས་ཤིན་ཏུ་བརྟན་པར་བྱའོ། །
en: Bodhisattvas should be as utterly stable as a doorsill.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ལ་ལྷག་པར་ཆགས་པ་མེད་པར་བྱའོ། །
en: Bodhisattvas should be particularly free of attachment to luxuries.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཡོངས་སུ་སྒྱུར་བ་ལ་མཁས་པས་དབང་དང་ལྡན་པར་བྱའོ། །
en: “Bodhisattvas should be powerful, skilled in transforming minds.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རྒྱ་ཆེན་པོ་ལ་མོས་པས་རྒྱལ་པོ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like kings, with a vast orientation.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསྟེན་པའི་འོས་སུ་གྱུར་པས་བརྒྱ་བྱིན་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should be like Śakra, worthy of being relied upon by all beings.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ཆོས་ཐམས་ཅད་ཀྱི་བདག་པོ་བྱེད་པས་ཚངས་པ་ལྟ་བུར་བྱའོ། །
en: Bodhisattvas should also be like Brahmā, acting as lord of all things.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་གཏན་དུ་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་འགོད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་བསྒྲུབ་པར་བྱའོ། །
en: Bodhisattvas should work for all beings’ welfare, establishing them in the lasting happiness of the transcendence of suffering.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་དངོས་པོ་བསྟབས་པས་ཕ་མ་དང་འདྲ་བར་བྱའོ། །
en: Bodhisattvas should be like a father or mother to all beings, giving them things that are helpful and pleasing.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱིས་མ་ཉམས་མ་སྨས་པར་བྱའོ། །
en: Bodhisattvas should be unspoiled and unimpaired by any wholesome or unwholesome qualities.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་མཛའ་བཤེས་དང་དགྲ་རྣམས་ལ་སེམས་སྙོམས་པས་ཞེ་འགྲས་པ་མེད་པར་བྱའོ། །
en: Bodhisattvas should be free of enmity, impartial toward both friends and enemies.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་སྐྱེ་བའི་གནས་ཐམས་ཅད་ལ་ཡིད་བརྟན་པར་མི་བྱའོ། །
en: Bodhisattvas should not put their trust in any mode of birth.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་ལྷུག་པར་གཏོང་བས་ཆོས་ཀྱི་སྦྱིན་བདག་བྱའོ། །
en: Bodhisattvas should be spiritual benefactors, giving liberally.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་བག་ཡོད་པས་རྒྱགས་པ་དང་། བག་མེད་པ་ཐམས་ཅད་དང་བྲལ་བར་བྱའོ། །
en: Bodhisattvas, without being infatuated by their conscientiousness, should be entirely free of carelessness.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཚོལ་བ་དང་། སྤྱོད་པ་དང་། སྡོམ་པ་དང་། བསླབ་པ་དང་། བརྩོན་འགྲུས་རྣམས་ལ་བག་ཡོད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ། །
en: Mañjuśrī, bodhisattvas who endeavor in bodhisattva practice—who are conscientious in practice, vows, training, and diligence—are capable of fully awakening to unexcelled and perfectly complete buddhahood.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་པ་བརྟན་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One, expressing his approval of what Bodhisattva Constant Stable Diligence had explained, said to him,

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་གནས་པ་ལ་མཁས་པ་འདི་ཁྱོད་ཀྱིས་ལེགས་པར་སྨྲས་སོ། །
en: You have described very well the skill of remaining constantly in the bodhisattva’s practice.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འདོད་པས་ནི་བསོད་ནམས་མ་ཡིན་པ་ཐམས་ཅད་དང་བྲལ་བར་བྱ་བ་དང་། བསོད་ནམས་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་ལ་བརྩོན་པར་བྱའོ། །
en: Son of noble family, bodhisattva great beings who wish to achieve this absorption that encapsulates all merit should avoid everything that is not meritorious, and exert themselves in taking up everything that is meritorious.”

source: བཅོམ་ལྡན་འདས་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པ་ནི་གང་དག་ལགས།
en: “Blessed One, what distinguishes bodhisattvas who have achieved this absorption that encapsulates all merit?

source: རྟག་ནི་གང་དག་ལགས།
en: What signs do they have?

source: མཚན་མ་ནི་གང་དག་ལགས།
en: What marks?

source: ཡོན་ཏན་ནི་གང་དག་ལགས།
en: What qualities?

source: ཕན་ཡོན་ནི་གང་དག་ལགས།
en: What benefits?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྲེད་མེད་ཀྱི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered Bodhisattva Nārāyaṇa,

source: རིགས་ཀྱི་བུ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་མི་ཁོམ་པ་བརྒྱད་ལས་ལོག་པས་ན་ངན་སོང་དང་བྲལ་བ་ཡིན་ནོ། །
en: “Son of noble family, bodhisattvas who have achieved this absorption that encapsulates all merit have left the eight unfree states behind, and will not be born in the lower realms.

source: བསམས་པ་ཙམ་གྱིས་ཐམས་ཅད་འགྲུབ་པས་ན་དབུལ་བ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ་ཡང་ཡིན་ནོ། །
en: Whatever they even wish for is actualized, so they are able to genuinely alleviate all poverty.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་པས་ན་དབང་པོ་ཚང་བ་ཡང་ཡིན་ནོ། །
en: They are adorned with the thirty-two major marks of a great being, and are replete with all the faculties.

source: མི་ཟད་པའི་ཆོས་ཉིད་ཀྱིས་ན་སྤོབས་པ་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: Because of the unending true nature, they achieve eloquence.

source: བརྗེད་ངས་པ་མེད་པས་ན་གཟུངས་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: They have no forgetting, and thus achieve retention.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བས་ན་བསོད་ནམས་ཐམས་ཅད་ཀྱིས་མཐོ་བ་ཡང་ཡིན་ནོ། །
en: They turn the wheel of Dharma, and are thus exalted by a plenitude of merit.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་གི་དབང་ཐོབ་པས་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོད་པའི་གནས་ཀྱི་དབང་བསྐུར་བ་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: They achieve the power of Śakra, Brahmā, and the world protectors, and are empowered as objects of veneration by all beings.

source: མངོན་པར་ཤེས་པ་མ་ཉམས་པས་ན་མངོན་པར་ཤེས་པ་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: Their superknowledge is unimpaired, and they achieve superknowledge.

source: སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་དབང་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: They gain control over all modes of birth.

source: ཆོས་ཀྱི་ནོར་ཐམས་ཅད་རྣམ་པར་འཕེལ་བས་ན་ཐབས་ཀྱིས་མཛོད་མི་ཟད་པ་ཡང་ཡིན་ནོ། །
en: All the riches of the teachings increase in them, and in their methods they are inexhaustible treasuries.

source: སྡིག་པའི་ལྟ་བ་དང་བྲལ་བས་ན་ཤེས་རབ་ཀྱིས་ཀུན་ཏུ་ལྟ་བ་ཡང་ཡིན་ནོ། །
en: They are free of harmful views, and perceive everything with their insight.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པ་མེད་པ་ཡང་ཡིན་ནོ། །
en: “They have no desire for the levels of the śrāvakas or solitary buddhas.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འདུལ་བ་པོ་ཡང་ཡིན་ནོ། །
en: They are the ones who train all the śrāvakas and solitary buddhas.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དབང་པོ་ལ་མཁས་པ་ཡང་ཡིན་ནོ། །
en: They have expertise in the faculties of beings, which they use to bring them all to maturation.

source: བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ལ་རྣམ་པར་རྩེ་བ་ཡང་ཡིན་ནོ། །
en: They revel in concentration, absorption, equipoise, and the gateways of liberation.

source: གཏོང་བ་ལ་མོས་པས་ན་མ་བསྟན་པའི་སྦྱིན་པ་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: Being devoted to giving, they possess untaught generosity.

source: སྡོམ་པ་གསུམ་ཡོངས་སུ་དག་པས་ན་མ་བསྟན་པའི་ཚུལ་ཁྲིམས་ཅན་ཡང་ཡིན་ནོ། །
en: Their three vows being utterly pure, they possess untaught discipline.

source: སེམས་ཀྱི་རྒྱུད་ལ་བྱམས་པ་མངོན་པར་བསྒྲུབས་པས་ན་བཟོད་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: Having actualized love in their mindstreams, they acquire unfathomable patience.

source: ཡིད་སྐྱོ་བ་མེད་པས་ན་སེམས་ཅན་ཐམས་ཅད་ལ་བརྩོན་འགྲུས་རྩོམ་པ་ཡང་ཡིན་ནོ། །
en: Never discouraged, they work diligently for all beings.

source: དབེན་པ་ལ་མོས་པས་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་སོན་པ་ཡང་ཡིན་ནོ། །
en: Devoted to solitude, they reach perfection in concentration.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདོད་པའི་ཁམས་སུ་ཡང་སྐྱེ་བར་འགྱུར་རོ། །
en: To bring all beings to maturation, they take birth in the desire realm.

source: སྒྲ་དང་སྒྲ་མ་ཡིན་པ་སོ་སོར་བརྟག་པ་ལ་མཁས་པས་ན་ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་རྣམ་པར་དག་པ་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: Skilled in the discernment of what is pronounced and what is not pronounced, through insight they possess pure liberation.

source: ཡ་ང་བའི་ལམ་ཡོངས་སུ་སྤངས་པས་ན་མིག་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: Having abandoned dangerous paths, they possess vision.

source: ཆོས་ཉིད་དང་སངས་རྒྱས་མཐོང་བ་དང་ཡང་མ་བྲལ་བ་ཡིན་ནོ། །
en: They are never apart from beholding the true nature and buddhahood.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། མ་བྱུང་བ་དང་། མ་སྐྱེས་པ་དང་། དངོས་པོ་མེད་པའི་སྒྲ་དང་ཡང་མ་བྲལ་བ་ཡིན་ནོ། །
en: They are never apart from pronouncements of emptiness, signlessness, wishlessness, the unconditioned, non-occurrence, non-origination, and non-substantiality.

source: སངས་རྒྱས་ཀྱིས་གསུངས་པ་ཐམས་ཅད་ཀྱང་འཛིན་ཏོ། །
en: They retain everything the Buddha has said.

source: ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་མཐོང་བ་དང་ཡང་མི་འབྲལ་བ་ཡིན་ནོ། །
en: They are never apart from meeting the community of irreversible bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པས་ན་སྒྲིབ་པ་མེད་པར་གྲོལ་བ་ཡང་ཡིན་ནོ། །
en: “They possess all the qualities of buddhafields, and are liberated without obscurations.

source: བདུད་བཞི་སྤངས་པས་ན་བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་ཡང་ཡིན་ནོ། །
en: They have dispelled the four demons, and have thus vanquished demons and hostile forces.

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཅན་ཡིན་པས་ན་ཟབ་མོ་བཟོད་པ་ཡང་ཡིན་ནོ། །
en: They are characterized by being irreversible, and have acceptance of the profound.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་ཆོ་འཕྲུལ་གྱིས་ན་མངོན་པར་ཤེས་པ་མྱུར་བ་ཡང་ཡིན་ནོ། །
en: Through the magical power of the Buddha’s teachings, they gain swift superknowledge.

source: དེ་ནི་མ་ཐོས་པའི་ཆོས་ཀྱི་རྒྱུན་ཀྱང་རྣམ་པར་རིག་པར་ཡང་འགྱུར་རོ། །
en: They even understand the stream of teachings they have not heard.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་ཡོངས་སུ་དག་པ་རྒྱ་ཆེན་པོ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པས་ན་བསམ་པ་ཐམས་ཅད་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: They hold all the extensive, pure qualities of buddhafields, and possess all intentions.

source: དེའི་བག་ཆགས་ཀྱི་ཉིང་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཀྱང་ཕྱིར་ལོག་པ་ཡང་ཡིན་ནོ། །
en: They leave behind all transmigration caused by their own habitual tendencies.

source: ལུས་དང་། གཟུགས་དང་། ལུས་ཀྱི་ངོ་བོ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པས་ན་ཡིད་ལས་བྱུང་བའི་གནས་དང་། ལུས་ངེས་པ་ཡང་ཡིན་ནོ། །
en: They manifest all sorts of bodies, forms, and bodily natures, and are certain of mentally created abodes and bodies.

source: ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་མི་ཚུགས་པ་ཡང་ཡིན་ནོ། །
en: They are not affected by any opponent.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཡང་ཡིན་ནོ། །
en: They uphold the blessed buddhas’ sublime teachings.

source: དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་བའི་ཕྱིར། ལུས་དང་སྲོག་ཡོངས་སུ་གཏོང་བ་ཡང་ཡིན་ནོ། །
en: They give up even their bodies and lives to preserve the sublime teachings.

source: སངས་རྒྱས་ཀྱི་ཡུལ་ཡང་སྟོན་ལ། གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་མི་བྱེད་དོ། །
en: Since they display the domains of buddhas and have forever passed beyond suffering, they do not pass beyond suffering.

source: འཁོར་གྱིས་བག་ཚ་བ་དང་། འཇིགས་པ་དང་བྲལ་བས་ན་མི་འཇིགས་པ་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: “Having no anxiety or trepidation in the face of an audience, they attain fearlessness.

source: བྱ་བ་ཐམས་ཅད་ཀྱང་ཤེས་པས་བྱེད་ཀྱི་ང་རྒྱལ་གྱིས་བྱེད་པ་མ་ཡིན་ནོ། །
en: They know all actions, yet they do not carry them out with pride in doing something.

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་རྣམ་པར་འཕྲུལ་པས་ན་བཀོད་པ་ཆེན་པོ་དང་ལྡན་པ་ཡང་ཡིན་ནོ། །
en: They emanate within the illusory absorption, and attain the great display.

source: གནོད་པ་ཐམས་ཅད་དང་བྲལ་བས་ན་མི་གཡོ་བའི་ཤུགས་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: They cannot be harmed in any way, and attain unwavering strength.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཚིག་གིས་ཤིན་ཏུ་གོ་བར་བྱེད་པས་ན་སྒྲའི་ཚོགས་ཡོངས་སུ་དག་པ་ཡང་ཡིན་ནོ། །
en: They can make their words perfectly heard throughout all the buddhafields, and have complete purity in the accumulation of speech.

source: བདུད་ཀྱི་དཔུང་ཐམས་ཅད་འཇོམས་པས་ན་སེམས་དཔའ་བ་ཡང་ཡིན་ནོ། །
en: Having vanquished all the demon hordes, they are heroes.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་གཡོ་བར་བྱེད་པས་ན། རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཡིན་ནོ། །
en: They can make every buddhafield tremble, and have attained transcendence in miraculous manifestation.

source: དོན་དང་། ཆོས་དང་། ངེས་པའི་ཚིག་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པས་ན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ་ཡང་ཡིན་ནོ། །
en: Their meanings, teachings, definitions, and eloquence are all perfect, and they have achieved true discerning knowledge.

source: བག་ཡོད་པས་ན་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་མོས་པ་ཡང་ཡིན་ནོ། །
en: They are conscientious, and devoted to unimpeded wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡང་དག་པར་སྟོན་པས་ན།
en: They point out true omniscient wisdom to all beings, and

source: སངས་རྒྱས་ཀྱི་ཕྲིན་ལས་ལ་ཉེ་བར་གནས་པ་ཡང་ཡིན་ནོ། །
en: dwell in the activity of buddhas.

source: སྲེད་མེད་ཀྱི་བུ་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ལ་ངེས་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་དག་གི་རྣམ་པ་ནི་དེ་དག་ཡིན་ནོ། །
en: “Nārāyaṇa, bodhisattvas who have certainty in this absorption that encapsulates all merit can be distinguished in these ways.

source: རྟགས་ནི་དེ་དག་ཡིན་ནོ། །
en: These qualities can also be characterized as their signs, [marks, qualities, or benefits.]”

source: མཚན་མ་ནི་དེ་དག་ཡིན་ནོ། །
en: These qualities can also be characterized as their [signs,] marks, [qualities, or benefits.]”

source: ཡོན་ཏན་དང་། ཕན་ཡོན་ནི་དེ་དག་ཡིན་ནོ། །
en: These qualities can also be characterized as their [signs, marks,] qualities, or benefits.”

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་བསོད་ནམས་ཐམས་ཅད་བསྡུས་པའི་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་གྱུར་ཅིག །
en: “Blessed One, may all beings achieve this absorption that encapsulates all merit!

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱང་ཅི་ནས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་ནས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་མ་མཆིས་པའི་ཡོན་ཏན་དང་། ཕན་ཡོན་གང་དག་ལགས་པ་འདི་དག་དང་ལྡན་པར་གྱུར་ཅིག །
en: May bodhisattvas who have achieved this absorption come to acquire as well all the qualities and benefits that are not possessed by any śrāvakas and solitary buddhas!

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་དག་ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་འདི་རྣ་ལམ་དུ་མི་ཐོས་པ་དང་། ཐོས་ན་ཡང་མོས་པར་མི་འགྱུར་བ་དེ་དག་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ལགས་སོ། །
en: Blessed One, any beings who have not come to hear about this precious absorption—or who do not devote themselves to it once they have heard it—must indeed be influenced by demons.”

source: སྲེད་མེད་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: “Precisely, Nārāyaṇa.

source: ཁྱོད་ཚིག་ཇི་སྐད་ཟེར་བ་བཞིན་ནོ། །
en: It is just as you have said.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཏིང་ངེ་འཛིན་འདིས་ངེས་པར་བྱུང་བ་རྣམས་དང་། ངེས་པར་འབྱུང་བ་རྣམས་དང་། ངེས་པར་འབྱུང་བར་འགྱུར་བ་དེ་དག་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ་དང་།
en: Moreover, those bodhisattvas who have emerged, are emerging, or will emerge definitively by way of this absorption, acquire an unfathomable number of qualities.

source: ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: They acquire an inconceivable number of qualities.”

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འདོད་པས་ཆོས་གང་དག་ལ་སྦྱོར་བར་བྱ།
en: “Mañjuśrī, when bodhisattva great beings wish to achieve this absorption, what Dharma should they strive in?”

source: སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འདོད་པས་ནི་སོ་སོ་སྐྱེ་བོའི་ཆོས་རྣམས་ཀྱང་ཆུད་མི་གཟན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་འཐོབ་པར་མི་བྱ་བའི་ཕྱིར་སྦྱོར་བར་བྱའོ། །
en: “Nārāyaṇa, bodhisattva great beings who wish to achieve this absorption should not strive to eradicate the qualities associated with ordinary beings, nor to attain the qualities of awakening.

source: ཅི་ནས་ཆོས་དང་ཆོས་མ་ཡིན་པ་ལ་སྦྱོར་བར་ཡང་མི་བྱ།
en: They should not strive in any way toward the Dharma or dissociate themselves from non-Dharma;

source: འབྲལ་བར་ཡང་མི་བྱ་བ་དེ་ལྟར་དེས་སྦྱོར་བར་བྱའོ། །
en: that is the way they should strive.

source: ཅི་ནས་འཁོར་བའི་ཁོངས་སུ་ཡང་གཏོགས་ལ། འཁོར་བར་བྱ་བའི་ཕྱིར་ཡང་སློབ་པར་མི་བྱེད་པ་དང་།
en: While being within cyclic existence, they should not train in such a way that perpetuates cyclic existence,

source: འཁོར་བའི་ཉེ་བའི་ཉོན་མོངས་པས་ཀྱང་ཉོན་མོངས་པར་མི་འགྱུར་བ་དང་།
en: and they should not be afflicted by the subsidiary afflictions of cyclic existence.

source: མྱ་ངན་ལས་འདའ་བའི་ཕྱིར་ཡང་སློབ་ལ།
en: They should train toward the transcendence of suffering, but

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་མི་བྱེད་པ་དེ་ལྟར་དེས་སྦྱོར་བར་བྱའོ། །
en: they should strive in such a way that they do not transcend suffering in the way that the śrāvakas and solitary buddhas transcend suffering.

source: གཞན་ཡང་སྲེད་མེད་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་འདོད་པས་ནི། བསོད་ནམས་ཐམས་ཅད་ཡང་དག་པར་འབྱུང་བ་ལ་བསླབ་པར་བྱ་སྟེ།
en: “Furthermore, Nārāyaṇa, bodhisattva great beings who wish to achieve this absorption should train in truly bringing forth all merit.

source: ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་བསོད་ནམས་དག་ལ་ཡང་རྣམ་པར་རྟོག་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: They should not form concepts about merit being of a defiled or undefiled type.

source: ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་དག་ལ་ཡང་རྣམ་པར་རྟོག་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: They should not form concepts about things being meritorious or unmeritorious, whether they are immoral or moral, conditioned or unconditioned, mundane or supramundane.

source: དེས་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བའི་བསོད་ནམས་ཐམས་ཅད་ལ་མོས་པར་བྱའོ། །
en: They should devote themselves to all merit that is subsumed in the realm of phenomena.

source: དེས་བསོད་ནམས་དང་། མི་གཡོ་བའི་འདུ་བྱེད་རྣམས་ལ་མཚན་ཉིད་གཅིག་པར་འཇུག་པར་བྱའོ། །
en: They should embrace merit in the sense that it shares the same characteristics as a nonfluctuating formation.

source: དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱང་འདི་དང་འདྲ་བར་བལྟ་བར་བྱ་སྟེ། འཁོར་བ་མེད་པར་ཉམས་སུ་མྱོང་བའི་ཕྱིར་རོ། །
en: They should regard all beings’ merit as being like this, since they experience the absence of cyclic existence.

source: སངས་རྒྱས་གཅིག་གི་བསོད་ནམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: They should regard the merit of one buddha or that of all buddhas as being similar.

source: འོན་ཀྱང་འདྲ་བ་དང་མི་འདྲ་བ་ཡང་ཅུང་ཟད་ཀྱང་བལྟ་བར་མི་བྱ་སྟེ། ཆོས་ཀྱི་དབྱིངས་ལ་ཁྱད་པར་མེད་པའི་ཕྱིར་རོ། །
en: At the same time, they should not regard things as being similar or dissimilar, even in the slightest degree, since there are no such distinctions in the realm of phenomena.

source: སོ་སོའི་སྐྱེ་བོའི་བསོད་ནམས་གང་དག་ཡིན་པ་དང་། སློབ་པའི་བསོད་ནམས་གང་དག་ཡིན་པ་དང་། མི་སློབ་པའི་བསོད་ནམས་གང་དག་ཡིན་པ་དང་། རང་སངས་རྒྱས་ཀྱི་བསོད་ནམས་གང་དག་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་གང་དག་ཡིན་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བསོད་ནམས་གང་དག་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཡང་དག་པ་མ་ཡིན་པ། དངོས་པོ་མེད་པ། ཡུལ་ན་མི་གནས་པ། ཕྱོགས་ན་མི་གནས་པ་ཡིན་པར་མོས་པར་བྱའོ། །
en: They should have conviction that all merit—whether it is that of ordinary beings, that which is associated with training or nontraining, that of solitary buddhas, that of bodhisattvas, or that of completely perfect buddhas—is unreal and insubstantial, with no fixed place or location.

source: བསོད་ནམས་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་འབྲེལ་བར་མོས་པར་བྱའོ། །
en: And yet they should have conviction that all merit has a connection with all sentient beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་གཟུགས་གང་ཅིའང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་འབྱུང་བ་ཆེན་པོ་བཞི་པོ་དག་དང་། འབྱུང་བ་ཆེན་པོ་བཞི་པོ་རྒྱུར་བྱས་པའི་གཟུགས་ཞེས་བྱའོ། །
en: “Son of noble family, consider how any possible physical form is considered to consist and be composed of the four great elements.
